FemDesign.Calculate.Footfall.#ctor
Parameterless constructor for serialization.

FemDesign.Calculate.Footfall.#ctor(System.Double)
Define calculation parameters for a footfall calculation.
top: Top of substructure. Masses on this level and below are not considered in Footfall calculation.

FemDesign.Calculate.Footfall.Default
Define default calculation parameters for a footfall calculation.
Returns: